xnjxuxid/stm32_dji_motor/Src/app_tasks.c
/**
  ******************************************************************************
  * @file    app_tasks.c
  * @brief   三个 FreeRTOS 任务
  *
  *   Task_MotorCtrl (1ms, vTaskDelayUntil) : 取 CAN 反馈 → 双环 PID → 发电压指令
  *   Task_Log       (5ms, vTaskDelayUntil) : VOFA 打印（文本 / JustFloat 曲线）
  *   Task_Cmd       (事件驱动)             : 串口命令（设目标 / 改 PID 参数）
  *
  *  控制结构（双环）：
  *    目标角度 --[位置环]--> 速度目标(限幅) --[速度环]--> 电压 --> 电机
  ******************************************************************************
  */
#include "app_tasks.h"
#include "board_config.h"
#include "can.h"
#include "stm32f4xx_hal.h"
#include "uart_vofa.h"
#include "vofa_send.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

MotorCtrl_t g_ctrl;
GM6020_t    g_motor;

/* 诊断：收到了非本电机 ID 的反馈帧（说明总线通了，只是 ID 配错） */
static uint32_t s_rxOtherId = 0;

static void Task_MotorCtrl(void *arg);
static void Task_Log(void *arg);
static void Task_Cmd(void *arg);

/* ---------------- 工具 ---------------- */
static float ClampF(float v, float lo, float hi)
{
    if (v > hi) { return hi; }
    if (v < lo) { return lo; }
    return v;
}

/* ---------------- 创建 ---------------- */
void App_Tasks_Create(void)
{
    GM6020_Init(&g_motor, MOTOR_ID);

    /* PID 初值（保守，之后用串口命令调，不需要重新编译）
     * 速度环：outMax 用大值，实际限幅靠 g_ctrl.voltLimit
     * 位置环：输出是"速度目标"，所以 outMax = 速度上限 */
    PID_Init(&g_ctrl.pidSpeed, 30.0f, 2.0f, 0.0f, 0.001f, GM6020_VOLT_MAX, 15000.0f);
    PID_Init(&g_ctrl.pidAngle, 0.8f, 0.0f, 0.02f, 0.001f, MOTOR_SPEED_LIMIT_RPM, 60.0f);

    g_ctrl.mode       = MODE_IDLE;      /* 上电不输出，安全第一 */
    g_ctrl.voltCmd    = 0.0f;
    g_ctrl.speedTarget= 0.0f;
    g_ctrl.angleTarget= 0.0f;
    g_ctrl.speedCmd   = 0.0f;
    g_ctrl.voltLimit  = MOTOR_VOLT_LIMIT_DEFAULT;
    g_ctrl.speedLimit = MOTOR_SPEED_LIMIT_RPM;
    g_ctrl.out        = 0.0f;
    g_ctrl.logCurve   = 0U;

    xTaskCreate(Task_MotorCtrl, "motor", CTRL_TASK_STACK, NULL, CTRL_TASK_PRIO, NULL);
    xTaskCreate(Task_Log,       "log",   LOG_TASK_STACK,  NULL, LOG_TASK_PRIO,  NULL);
    xTaskCreate(Task_Cmd,       "cmd",   CMD_TASK_STACK,  NULL, CMD_TASK_PRIO,  NULL);
}

/* ---------------- 控制任务：1ms 绝对周期 ---------------- */
static void Task_MotorCtrl(void *arg)
{
    TickType_t    lastWake = xTaskGetTickCount();
    CanRxPacket_t pkt;
    QueueHandle_t q        = CAN_GetQueue();
    float         out      = 0.0f;
    float         speedCmd = 0.0f;

    (void)arg;

    for (;;)
    {
        vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(CTRL_TASK_PERIOD_MS));

        /* 1) 取走所有 CAN 反馈帧（ISR 只入队，这里才解析） */
        if (q != NULL)
        {
            while (xQueueReceive(q, &pkt, 0) == pdPASS)
            {
                if (pkt.id == MOTOR_FEEDBACK_ID)
                {
                    GM6020_Update(&g_motor, pkt.data);
                }
                else if ((pkt.id >= 0x200U) && (pkt.id <= 0x20FU))
                {
                    /* 收到了别的电机的反馈 → ID 配置不对，提示正确的 ID */
                    s_rxOtherId = pkt.id;
                }
            }
        }

        /* 2) 保护：反馈超时 → 立即停止输出并清积分（拔掉 CAN 线也安全） */
        if (!GM6020_IsOnline(&g_motor, MOTOR_RX_TIMEOUT_MS))
        {
            g_ctrl.out = 0.0f;
            PID_Reset(&g_ctrl.pidSpeed);
            PID_Reset(&g_ctrl.pidAngle);
            GM6020_SendStop(MOTOR_ID);
            continue;
        }

        /* 3) 模式机 + 双环 */
        switch (g_ctrl.mode)
        {
        case MODE_VOLT:
            out = g_ctrl.voltCmd;
            break;

        case MODE_SPEED:
            out = PID_Calc(&g_ctrl.pidSpeed,
                           g_ctrl.speedTarget, g_motor.speed);
            break;

        case MODE_ANGLE:
            /* 外环：角度误差 → 速度目标（限幅 = 给电机加"最高限速"） */
            speedCmd = PID_Calc(&g_ctrl.pidAngle,
                                g_ctrl.angleTarget, g_motor.angleCont);
            speedCmd = ClampF(speedCmd, -g_ctrl.speedLimit, g_ctrl.speedLimit);
            g_ctrl.speedCmd = speedCmd;
            /* 内环：速度误差 → 电压 */
            out = PID_Calc(&g_ctrl.pidSpeed, speedCmd, g_motor.speed);
            break;

        default:
            out = 0.0f;
            break;
        }

        /* 4) 输出限幅 + 下发 */
        out = ClampF(out, -g_ctrl.voltLimit, g_ctrl.voltLimit);
        g_ctrl.out = out;
        GM6020_SendVoltage(MOTOR_ID, out);
    }
}

/* ---------------- 日志/曲线任务：5ms 绝对周期 ---------------- */
static void Task_Log(void *arg)
{
    TickType_t lastWake = xTaskGetTickCount();
    uint32_t   tick     = 0;
    float      ch[4];

    (void)arg;

    for (;;)
    {
        vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(LOG_TASK_PERIOD_MS));

        if (g_ctrl.logCurve)
        {
            /* JustFloat 曲线（VOFA 选 JustFloat 协议）：
             * ch0 = 目标, ch1 = 实际, ch2 = 输出, ch3 = 误差 */
            switch (g_ctrl.mode)
            {
            case MODE_SPEED: ch[0] = g_ctrl.speedTarget; ch[1] = g_motor.speed;     break;
            case MODE_ANGLE: ch[0] = g_ctrl.angleTarget; ch[1] = g_motor.angleCont; break;
            default:         ch[0] = g_ctrl.voltCmd;     ch[1] = g_motor.speed;     break;
            }
            ch[2] = g_ctrl.out;
            ch[3] = ch[0] - ch[1];
            VOFA_SendJustFloat(ch, 4);
        }
        else
        {
            /* 文本模式：每 500ms 一行，便于直接看数值 */
            if ((++tick % 100U) == 0U)
            {
                /* CAN 错误状态（二分定位：物理层没通 vs ID 不对） */
                uint32_t esr  = hcan1.Instance->ESR;
                uint8_t  lec  = (uint8_t)((esr >> 4) & 0x07U);
                uint8_t  boff = (uint8_t)((esr >> 2) & 0x01U);
                uint8_t  tec  = (uint8_t)((esr >> 16) & 0xFFU);
                uint8_t  rec  = (uint8_t)((esr >> 24) & 0xFFU);

                printf("mode=%d online=%u rx=%lu ang=%.1f cont=%.1f spd=%.0f "
                       "cur=%.2fA tmp=%uC out=%.0f | can lec=%u tec=%u rec=%u boff=%u\r\n",
                       (int)g_ctrl.mode, (unsigned)g_motor.online,
                       (unsigned long)g_motor.rxCount,
                       g_motor.angleDeg, g_motor.angleCont, g_motor.speed,
                       g_motor.currentA, (unsigned)g_motor.tempC, g_ctrl.out,
                       (unsigned)lec, (unsigned)tec, (unsigned)rec, (unsigned)boff);

                if (s_rxOtherId != 0U)
                {
                    printf("note: got feedback from ID 0x%03lX -> set MOTOR_ID=%lu "
                           "in board_config.h\r\n",
                           (unsigned long)s_rxOtherId,
                           (unsigned long)(s_rxOtherId - 0x204U));
                }
            }
        }
    }
}

/* ---------------- 命令任务：串口调参（不重新编译） ---------------- */
static void HandleCommand(char *line)
{
    char  *cmd;
    char  *arg;
    float  v;

    cmd = strtok(line, " \r\n\t");
    if (cmd == NULL) { return; }
    arg = strtok(NULL, " \r\n\t");
    v   = (arg != NULL) ? (float)atof(arg) : 0.0f;

    if      (strcmp(cmd, "v")  == 0) {                      /* 直接给电压试转 */
        g_ctrl.mode = MODE_VOLT;
        g_ctrl.voltCmd = ClampF(v, -g_ctrl.voltLimit, g_ctrl.voltLimit);
        printf("volt mode: %.0f\r\n", g_ctrl.voltCmd);
    }
    else if (strcmp(cmd, "sp") == 0) {                      /* 速度环目标 */
        PID_Reset(&g_ctrl.pidSpeed);
        g_ctrl.mode = MODE_SPEED;
        g_ctrl.speedTarget = ClampF(v, -g_ctrl.speedLimit, g_ctrl.speedLimit);
        printf("speed target: %.1f rpm\r\n", g_ctrl.speedTarget);
    }
    else if (strcmp(cmd, "an") == 0) {                      /* 位置环：相对当前转 v 度 */
        PID_Reset(&g_ctrl.pidSpeed);
        PID_Reset(&g_ctrl.pidAngle);
        g_ctrl.mode = MODE_ANGLE;
        g_ctrl.angleTarget = g_motor.angleCont + v;
        printf("angle target: %.1f deg (now %.1f)\r\n",
               g_ctrl.angleTarget, g_motor.angleCont);
    }
    else if (strcmp(cmd, "kp")  == 0) { g_ctrl.pidSpeed.Kp = v; }
    else if (strcmp(cmd, "ki")  == 0) { g_ctrl.pidSpeed.Ki = v; }
    else if (strcmp(cmd, "kd")  == 0) { g_ctrl.pidSpeed.Kd = v; }
    else if (strcmp(cmd, "kp2") == 0) { g_ctrl.pidAngle.Kp = v; }
    else if (strcmp(cmd, "ki2") == 0) { g_ctrl.pidAngle.Ki = v; }
    else if (strcmp(cmd, "kd2") == 0) { g_ctrl.pidAngle.Kd = v; }
    else if (strcmp(cmd, "lv")  == 0) { g_ctrl.voltLimit = ClampF(fabsf(v), 0.0f, GM6020_VOLT_MAX); }
    else if (strcmp(cmd, "ls")  == 0) { g_ctrl.speedLimit = ClampF(fabsf(v), 0.0f, 320.0f); }
    else if (strcmp(cmd, "log") == 0) { g_ctrl.logCurve = (v > 0.0f) ? 1U : 0U; }
    else if (strcmp(cmd, "zero")== 0) { GM6020_ZeroAngle(&g_motor); printf("angle zeroed\r\n"); }
    else if (strcmp(cmd, "stop")== 0) { g_ctrl.mode = MODE_IDLE; PID_Reset(&g_ctrl.pidSpeed); PID_Reset(&g_ctrl.pidAngle); }
    else if (strcmp(cmd, "help")== 0 || strcmp(cmd, "?") == 0)
    {
        printf("== commands ==\r\n"
               " v <volt>   direct voltage (try small first)\r\n"
               " sp <rpm>   speed loop target (GM6020 max 320rpm)\r\n"
               " an <deg>   angle loop: rotate N degrees (720 ok)\r\n"
               " kp/ki/kd   speed-loop gains | kp2/ki2/kd2 angle-loop gains\r\n"
               " lv <v>     voltage limit   | ls <rpm> inner speed limit\r\n"
               " log 1|0    curve/text print | zero=reset angle | stop\r\n");
    }
    else
    {
        printf("unknown: %s (send 'help')\r\n", cmd);
    }
}

static void Task_Cmd(void *arg)
{
    UartRxPacket_t pkt;
    QueueHandle_t  q = UART_GetQueue();

    (void)arg;

    for (;;)
    {
        if ((q != NULL) && (xQueueReceive(q, &pkt, portMAX_DELAY) == pdPASS))
        {
            if (pkt.len >= UART_RX_BUF_SIZE) { pkt.len = UART_RX_BUF_SIZE - 1; }
            pkt.buf[pkt.len] = '\0';
            HandleCommand((char *)pkt.buf);
        }
    }
}
